app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movies = Movie.find(params[:id])

INSERT INTO "movies" ("title", "URL", "movieType", "rating", "minutes", "year", "genres", "votes", "released", "directors", "createdTime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "rating" = ?, "createdTime" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "7.3"], ["createdTime", "2021-01-06 00:54:00"], ["updated_at", "2021-01-06 00:54:27.842916"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)